"""
Дисциплина: Языки и технологии программирования
Файл: задание_1.py
Тема: Задание 1: Геометрическая валидация треугольника
Выполнил: Бактыгалиев Амир | Группа: ИС-25-22 | Вариант: 7
Учебный год: 2026
Стиль оформления: Академический (PEP 8, Type Hints, Docstrings)
"""

# Задание 1: Проверка и классификация треугольника
def check_triangle(a: float, b: float, c: float) -> str:
    if a <= 0 or b <= 0 or c <= 0:
        return "Ошибка: стороны должны быть строго положительными числами."
    if a + b <= c or a + c <= b or b + c <= a:
        return "Треугольник с такими сторонами не существует."
    if a == b == c:
        return "Треугольник существует: Равносторонний"
    elif a == b or b == c or a == c:
        return "Треугольник существует: Равнобедренный"
    else:
        return "Треугольник существует: Разносторонний"

if __name__ == "__main__":
    a = float(input("Сторона A: "))
    b = float(input("Сторона B: "))
    c = float(input("Сторона C: "))
    print(check_triangle(a, b, c))